{
  "pages": {
    "experience": "experience",
    "education": "education",
    "aboutMe": "about me",
    "projects": "projects",
    "skills": "skills"
  },
  "hi": "Hey!",
  "aboutMe": "I'm a full-stack developer based in Poland. I specialize in developing front-ends, mobile Flutter apps and complete web applications, from the frontend to the backend and the database. I am passionate about creating visually appealing interfaces, intuitive UX and 3D modeling.",
  "ocs": {
    "main": "This is the largest project that I have been a part of. I was responsible for creating the frontend for a SCADA system, using new web technologies.",
    "des1": "The website was designed to reflect the functionality of a desktop graphical environment.",
    "des2": "It is possible to display large amounts of data with high density, and view live data.",
    "des3": "Data loading is done using gRPC technology. Queries and data conversion are performed in a Web Worker, so the UI is not blocked when loading large amounts of data.",
    "des4": "The tables support pagination, along with sorting and filtering data."
  },
  "bitrender": {
    "main": "This is my personal project, which was originally created as my engineering thesis, and now serves as an environment for learning new technologies and programming solutions.",
    "main1": "This is a service that allows for rendering of scenes and animations from Blender, on multiple machines simultaneously. Its distinguishing feature is that it allows for the rendering of a single frame on multiple machines at the same time, automatically, i.e. without requiring any specification of how to divide the frame.",
    "des1": "Currently, I am in the process of expanding the system to support user login, along with managing permissions and roles.",
    "des2": "The service allows for the rendering of a single frame to be divided among multiple machines, by dividing the number of samples of a given frame required for its rendering, and automatically merging the result back into one image. (The picture shows a visualization of the algorithm that combines the results from 4 machines, into one image)",
    "des3": "The service is able to manage multiple rendering machines with different performance levels, through testing their computational power, which is later used in the task-allocation process."
  },
  "education": {
    "university": "Opole University of Technology",
    "university1": "Computer Engineering - graduate studies",
    "university2": "Computer Engineering - undergraduate studies"
  },
  "bconf": {
    "main": "I's a mobile app that aims to assist in the installation and configuration process of devices that are connected to the phone via a USB cable.",
    "des1": "It allows to create protocols of a given installation and save them locally for later synchronisation with the server.",
    "des2": "The app has a built-in guide that allows the user to familiarize themselves with its functionality.",
    "des3": "The app has integration with a CI/CD system that automatically releases new versions of the app."
  },
  "cde": {
    "main": "The application was created to simplify the process of programming and debugging telemetry devices.",
    "des1": "It allows communication with the device through the console, sending commands and reading results.",
    "des2": "However, the main use is reading device registers, directly through the register view, or through formatted fields with specific types and entering new values into them.",
    "des3": "It communicates with the device using the Modbus protocol through a USB cable or network connection.    "
  },
  "present": "present",
  "cv": "Resume"
}
